Giorgiofox/ESP32SonosStreamer/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# HTTP server (web UI): larger headers + more URI handlers
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Main task stack (SSDP + XML parsing)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Default log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
